of90/tutorials/rheoFoam/OtherTests/Channel2D_VE/PTTLog/exponential/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
	type            zeroGradient;
    }
   
    walls
    {
	type            zeroGradient;       
    }

    outlet
    {
	type            fixedValue;
	value           uniform 0;      
    }

    frontAndBack
    {
	type            empty;     
    }
}

// ************************************************************************* //
